Repository: pingviini/jyu.pathkey
Catalog: jyu/pathkey/locales/*/LC_MESSAGES/jyu.pathkey.po
Languages: fi

source: Add pathkey
fi: Lisää polkuavain

source: Added a new pathkey.
fi: Uusi polkuavain lisätty

source: Content will be shown with the correct pathkey
fi: Kansion sisältö näytetään oikealla polkuavaimella

source: If you want to protect contents of this folder, set a pathkey.
fi: Aseta polkuavain, jos haluat suojata tämän kansion sisällön.

source: Info
fi: Tiedoksi

source: Modification of the pathkey succeeded.
fi: Polkuavaimen muuttaminen onnistui

source: Pathkey
fi: Anna polkuavain

source: Restricts access to content without proper path key.
fi: Estää pääsyn sisältöön ilman polkuavainta.

source: Succesfully deleted the pathkey.
fi: Polkuavain poistettu onnistuneesti.

source: help_pathkey_page_default_page
fi: Olet asettamassa polkuavainta kansion oletusnäkymälle. ${go_here} asettaaksesi polkuavaimen koko kansiolle.

source: help_sharing_go_here
fi: Mene tänne

source: pathkey_message
fi: Kansion sisältö näytetään oikealla polkuavaimella.

source: pathkey_restrict
fi: Pääsy sisältöön estetty polkuavaimella
