Repository: pingviini/jyu.pathkey
Catalog: src/jyu/pathkey/locales/*/LC_MESSAGES/jyu.pathkey.po
Languages: fi

source: <strong>Go to ${parent_pathkey_form} to set a pathkey for the entire container.</strong>
fi: <string>Mene ${parent_pathkey_form} asettaaksesi polkuavain koko kansiolle.</strong>

source: Added a new pathkey and related information about pathkey owner.
fi: Uusi polkuavain ja siihen liittyvät tiedot lisätty.

source: Additional English content
fi: Polkuavaimen englanninkielinen sisältö

source: Additional Finnish content
fi: Polkuavaimen suomenkielinen sisältö

source: Additional description for pathkey requester form
fi: Tarkempi kuvaus-/ohjeteksti polkuavainlomakkeelle.

source: Because you have permissions to modify content you can see the pathkey which is: <strong>${pk}</strong>
fi: Koska sinulla on oikeudet muokata sisältöä, näet kansioon asetetun polkuavaimen: <strong>${pk}</strong>

source: Delete pathkey
fi: Poista polkuavain

source: Deletes the pathkey from this item after sending the form.
fi: Poistaa polkuavaimen tästä kohteesta lomakkeen lähettämisen jälkeen

source: Enter the pathkey
fi: Anna polkuavain

source: Here you can customize the contents of the form requesting pathkey.
fi: Täällä voit muokata polkuavainta kysyvän lomakkeen ohjetekstiä.

source: If you want to protect contents of this folder, set a pathkey.
fi: Aseta polkuavain, jos haluat suojata tämän kansion sisällön.

source: Legend text
fi: Polkuavaimen legend-teksti

source: List all pathkeys
fi: Listaa kaikki polkuavaimet

source: Modification of the pathkey succeeded.
fi: Polkuavaimen muuttaminen onnistui

source: Name of the person who knows the pathkey.
fi: Polkuavaimen haltijan nimi.

source: Pathkey
fi: Polkuavain

source: Pathkey has already been set to a object in upper level (${acquired_pathkey_url}). Are you certain you want to set nested pathkeys?
fi: Polkuavain on jo asetettu ylemmällä tasolla olevaan kohteeseen (${acquired_pathkey_url}). Oletko varma, että haluat asettaa sisäkkäisen polkuavaimen?

source: Pathkey owner
fi: Polkuavaimen haltija

source: Pathkey owner: ${pk_owner}
fi: Polkuavaimen haltija: ${pk_owner}

source: Pathkey owners email
fi: Polkuavaimen omistajan sähköpostiosoite

source: Pathkey settings
fi: Polkuavaimen asetukset

source: Required input is missing.
fi: Vaadittavat tiedot puuttuvat.

source: Restrict access to Plone content without proper pathkey.
fi: Estää pääsyn Plonen sisältöön ilman oikeaa polkuavainta

source: Save
fi: Tallenna

source: Succesfully deleted the pathkey and related information.
fi: Polkuavain ja siihen liittyvät tiedot poistettu.

source: Succesfully deleted the pathkey.
fi: Polkuavain poistettu onnistuneesti.

source: This will be visible so that users know where to ask correct pathkey.
fi: Sähköpostiosoite näytetään polkuavainlomakkeella, jotta käyttäjät tietävät keneltä polkuavainta voi kysyä.

source: Warning
fi: Varoitus

source: You can ask the correct pathkey by sending email to ${pk_email}.
fi: Voit kysyä oikeaa polkuavainta sähköpostilla osoitteesta ${pk_email}.

source: You can give custom legend text
fi: Voit muokata lomakkeen legend-osassa näkyvää tekstiä

source: help_pathkey_page_default_page
fi: Olet asettamassa polkuavainta kansion oletusnäkymänä toimivalle sivulle (${url}).

source: parent folders pathkey-form
fi: kansion polkuavaimen lisäyssivulle

source: send
fi: lähetä
